OpenFOAM-10/tutorials/multiphase/interFoam/laminar/testTubeMixer/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            motionSolver;

    libs            ("libfvMeshMovers.so" "libfvMotionSolvers.so");

    motionSolver    solidBody;

    solidBodyMotionFunction multiMotion;

    // Table rotating in z axis
    rotatingTable
    {
        solidBodyMotionFunction rotatingMotion;
        rotatingMotionCoeffs
        {
            origin          (0 0.1 0);
            axis            (0 0 1);
            omega           6.2832; // rad/s
        }
    }

    //// Box rotates on rotating table
    //rotatingBox
    //{
    //    solidBodyMotionFunction rotatingMotion;
    //    rotatingMotionCoeffs
    //    {
    //        origin          (0 0 0);
    //        axis            (1 0 0);
    //        omega           12.5664; // rad/s
    //    }
    //}

    // Tube rocking on rotating table
    rotatingBox
    {
        solidBodyMotionFunction oscillatingRotatingMotion;
        oscillatingRotatingMotionCoeffs
        {
            origin          (0 0 0);
            omega           40;         // rad/s
            amplitude       (45 0 0);   // 45 degrees max tilt
        }
    }
}


// ************************************************************************* //
